weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_NTP.c
/**
 ******************************************************************************
 * @file    STM32_WifiESP_NTP.c
 * @author  Weedman
 * @version 1.3.0
 * @date    19 juin 2025
 * @brief   Implémentation des fonctions haut niveau NTP pour ESP01
 *
 * @details
 * Ce fichier source contient l'implémentation des fonctions NTP haut niveau :
 * - Configuration et synchronisation NTP (one shot ou périodique)
 * - Parsing et affichage de la date/heure NTP
 * - Support du changement d'heure automatique (DST - Daylight Saving Time)
 * - Accès à la configuration et à la dernière date reçue
 *
 * @note
 * - Nécessite le driver bas niveau STM32_WifiESP.h
 * - Nécessite le module WiFi STM32_WifiESP_WIFI.h
 *
 ******************************************************************************
 */

#include "STM32_WifiESP_NTP.h" // Inclusion du header du module NTP
#include <stdio.h>             // Pour printf, snprintf, etc.
#include <string.h>            // Pour manipulation de chaînes
#include <ctype.h>             // Pour fonctions de classification de caractères

/* ==================== DÉFINITIONS ==================== */
#define ESP01_NTP_SYNC_RETRY 3        // Nombre de tentatives de synchro
#define ESP01_NTP_SYNC_RETRY_MS 1000  // Délai entre tentatives de synchro (ms)
#define ESP01_NTP_INIT_DELAY_MS 2000  // Délai d'initialisation (ms)
#define ESP01_NTP_MIN_VALID_YEAR 1971 // Année minimum valide
#define ESP01_NTP_MIN_DATE_LEN 8      // Longueur minimale d'une date valide

/* ==================== VARIABLES STATIQUES ==================== */

/**
 * @brief Configuration NTP courante (locale)
 */
static esp01_ntp_config_t g_ntp_config = {
    // Structure de configuration NTP locale
    .server = ESP01_NTP_DEFAULT_SERVER,     // Serveur NTP par défaut
    .timezone = 0,                          // Fuseau horaire par défaut
    .period_s = ESP01_NTP_DEFAULT_PERIOD_S, // Période de synchronisation par défaut
    .dst_enable = true                      // Activation du DST par défaut
};

static char g_last_datetime[ESP01_NTP_DATETIME_BUF_SIZE] = {0}; // Dernière date/heure NTP reçue (brute)
static uint8_t g_ntp_updated = 0;                               // Flag indiquant si une nouvelle date NTP a été reçue
static uint32_t g_last_sync_time = 0;                           // Horodatage de la dernière synchronisation
static bool g_initialized = false;                              // État d'initialisation du module

/* ==================== PROTOTYPES DES FONCTIONS STATIQUES ==================== */
static bool is_dst_active(const ntp_datetime_t *dt);
static void apply_dst(ntp_datetime_t *dt);

/* ==================== FONCTIONS PRINCIPALES ==================== */

/**
 * @brief Configure la structure NTP locale (ne modifie pas le module ESP01).
 * @param ntp_server   Nom du serveur NTP.
 * @param timezone     Décalage horaire.
 * @param sync_period_s Période de synchronisation en secondes.
 * @param dst_enable   Active/désactive le changement d'heure automatique.
 * @return ESP01_OK si succès, ESP01_INVALID_PARAM sinon.
 */
ESP01_Status_t esp01_configure_ntp(const char *ntp_server, int timezone, int sync_period_s, bool dst_enable)
{
    ESP01_LOG_INFO("NTP", "Configuration NTP : serveur=%s, timezone=%d, period=%d, dst=%d",
                   ntp_server, timezone, sync_period_s, dst_enable); // Log de la configuration demandée
    VALIDATE_PARAM(ntp_server && strlen(ntp_server) < ESP01_NTP_MAX_SERVER_LEN, ESP01_INVALID_PARAM);
    if (esp01_check_buffer_size(strlen(ntp_server), ESP01_NTP_MAX_SERVER_LEN - 1) != ESP01_OK)
    {
        ESP01_LOG_ERROR("NTP", "Dépassement de la taille du buffer serveur NTP");
        ESP01_RETURN_ERROR("NTP_CONFIG", ESP01_BUFFER_OVERFLOW);
    }

    // Utiliser strncpy de façon sécurisée avec vérification explicite
    memset(g_ntp_config.server, 0, ESP01_NTP_MAX_SERVER_LEN);
    strncpy(g_ntp_config.server, ntp_server, ESP01_NTP_MAX_SERVER_LEN - 1);

    g_ntp_config.timezone = timezone;      // Affectation du fuseau horaire
    g_ntp_config.period_s = sync_period_s; // Affectation de la période de synchronisation
    g_ntp_config.dst_enable = dst_enable;  // Activation/désactivation du DST

    ESP01_LOG_INFO("NTP", "Configuration NTP appliquée"); // Log de succès
    return ESP01_OK;                                      // Retourne OK
}

/**
 * @brief Lance la synchronisation NTP (one shot ou périodique selon periodic).
 * @param periodic true = périodique, false = one shot.
 * @return ESP01_OK si succès, code d'erreur sinon.
 */
ESP01_Status_t esp01_ntp_start_sync(bool periodic)
{
    ESP01_LOG_INFO("NTP", "Démarrage de la synchronisation NTP (periodic=%d)", periodic);

    // Application de la configuration NTP au module ESP01
    ESP01_Status_t st = esp01_apply_ntp_config(
        1,
        g_ntp_config.timezone,
        g_ntp_config.server,
        g_ntp_config.period_s);

    if (st != ESP01_OK)
    {
        ESP01_LOG_ERROR("NTP", "Echec de l'application de la configuration NTP (code=%d)", st);
        ESP01_RETURN_ERROR("NTP_START_SYNC", st);
    }

    if (!periodic) // Mode one-shot
    {
        HAL_Delay(ESP01_NTP_INIT_DELAY_MS); // Attente pour initialisation NTP

        char buf[ESP01_NTP_DATETIME_BUF_SIZE];
        for (int i = 0; i < ESP01_NTP_SYNC_RETRY; ++i)
        {
            st = esp01_get_ntp_time(buf, sizeof(buf));
            if (st == ESP01_OK && strlen(buf) > 0)
            {
                // Vérifier la validité de la date NTP (éviter 1970)
                ntp_datetime_t dt;
                if (esp01_parse_ntp_esp01(buf, &dt) == ESP01_OK && dt.year > 1970)
                {
                    if (esp01_check_buffer_size(strlen(buf), ESP01_NTP_DATETIME_BUF_SIZE - 1) != ESP01_OK)
                    {
                        ESP01_LOG_ERROR("NTP", "Dépassement de la taille du buffer datetime NTP");
                        ESP01_RETURN_ERROR("NTP_START_SYNC", ESP01_BUFFER_OVERFLOW);
                    }
                    // Copier la date obtenue dans le buffer global
                    strncpy(g_last_datetime, buf, ESP01_NTP_DATETIME_BUF_SIZE - 1);
                    g_last_datetime[ESP01_NTP_DATETIME_BUF_SIZE - 1] = '\0';
                    g_ntp_updated = 1;
                    ESP01_LOG_INFO("NTP", "Synchronisation NTP réussie : %s", g_last_datetime);
                    return ESP01_OK;
                }
                else
                {
                    ESP01_LOG_ERROR("NTP", "Synchronisation NTP échouée ou date invalide : %s", buf);
                }
            }
            else
            {
                ESP01_LOG_WARN("NTP", "Tentative %d de récupération de l'heure NTP échouée", i + 1);
            }
            HAL_Delay(ESP01_NTP_SYNC_RETRY_MS);
        }
        ESP01_LOG_ERROR("NTP", "Impossible de récupérer une date NTP valide après %d tentatives", ESP01_NTP_SYNC_RETRY);
        ESP01_RETURN_ERROR("NTP_START_SYNC", ESP01_FAIL);
    }

