weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_NTP.c
    // Mode périodique
    g_initialized = true;
    g_last_sync_time = 0; // Force une première synchronisation immédiate
    ESP01_LOG_INFO("NTP", "Synchronisation NTP périodique activée");
    return ESP01_OK;
}

/**
 * @brief Applique la configuration NTP au module ESP01 (commande AT).
 * @param enable      1 pour activer NTP, 0 pour désactiver.
 * @param timezone    Décalage horaire.
 * @param server      Nom du serveur NTP.
 * @param interval_s  Période de synchronisation (s).
 * @retval ESP01_Status_t
 */
ESP01_Status_t esp01_apply_ntp_config(uint8_t enable, int timezone, const char *server, int interval_s)
{
    VALIDATE_PARAM(server && strlen(server) > 0, ESP01_INVALID_PARAM);

    char cmd[ESP01_MAX_CMD_BUF] = {0};   // Buffer pour la commande AT
    char resp[ESP01_MAX_RESP_BUF] = {0}; // Buffer pour la réponse
    ESP01_Status_t st;                   // Variable de statut

    ESP01_LOG_INFO("NTP", "Application de la configuration NTP : enable=%d, timezone=%d, server=%s",
                   enable, timezone, server); // Log de la configuration

    // Construction de la commande sécurisée avec vérification des limites
    int written = snprintf(cmd, sizeof(cmd), "AT+CIPSNTPCFG=%d,%d,\"%s\"", enable, timezone, server);
    if (written < 0 || written >= (int)sizeof(cmd))
    {
        ESP01_LOG_ERROR("NTP", "Débordement du buffer de commande NTP");
        ESP01_RETURN_ERROR("NTP_APPLY_CONFIG", ESP01_BUFFER_OVERFLOW);
    }

    // Envoi de la commande AT au format RAW pour bénéficier de plus d'options
    st = esp01_send_raw_command_dma(cmd, resp, sizeof(resp), "OK", ESP01_TIMEOUT_SHORT);

    if (st != ESP01_OK) // Vérification du succès
    {
        ESP01_LOG_ERROR("NTP", "Echec de la commande AT+CIPSNTPCFG (code=%d)", st); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_APPLY_CONFIG", st);                                 // Retourne l'erreur
    }

    ESP01_LOG_INFO("NTP", "Configuration NTP envoyée avec succès"); // Log de succès
    return st;                                                      // Retourne le statut
}

/**
 * @brief Fonction principale de gestion périodique du NTP
 * @return ESP01_Status_t - ESP01_OK si tout s'est bien passé
 */
ESP01_Status_t esp01_ntp_handle(void)
{
    if (!g_initialized)
    {
        ESP01_LOG_WARN("NTP", "Module non initialisé");
        ESP01_RETURN_ERROR("NTP_HANDLE", ESP01_NOT_INITIALIZED);
    }

    uint32_t current_time = HAL_GetTick();
    uint32_t sync_interval = g_ntp_config.period_s * 1000; // Conversion en ms

    // Vérifier s'il est temps de synchroniser
    if ((current_time - g_last_sync_time) >= sync_interval)
    {
        ESP01_LOG_DEBUG("NTP", "Synchro NTP périodique...");

        // Récupérer l'heure NTP
        char datetime_str[ESP01_NTP_DATETIME_BUF_SIZE] = {0};
        ESP01_Status_t status = esp01_get_ntp_time(datetime_str, sizeof(datetime_str));

        if (status == ESP01_OK && strlen(datetime_str) > 0)
        {
            ESP01_LOG_DEBUG("NTP", "Date extraite: '%s'", datetime_str);

            // Parse la date récupérée
            ntp_datetime_t dt;

            if (esp01_parse_ntp_esp01(datetime_str, &dt) == ESP01_OK)
            {
                ESP01_LOG_DEBUG("NTP", "Date parsée: %02d/%02d/%04d %02d:%02d:%02d (jour %d)",
                                dt.day, dt.month, dt.year, dt.hour, dt.min, dt.sec, dt.wday);

                // Appliquer le DST si activé
                if (g_ntp_config.dst_enable)
                {
                    apply_dst(&dt);
                    dt.dst = true; // Marquer comme ajusté DST
                }

                // Stocker la date NTP brute
                memset(g_last_datetime, 0, ESP01_NTP_DATETIME_BUF_SIZE);
                strncpy(g_last_datetime, datetime_str, ESP01_NTP_DATETIME_BUF_SIZE - 1);
                g_ntp_updated = 1;

                // Formater pour affichage
                char buffer_fr[100] = {0};
                char buffer_en[100] = {0};

                if (esp01_format_datetime_fr(&dt, buffer_fr, sizeof(buffer_fr)) == ESP01_OK &&
                    esp01_format_datetime_en(&dt, buffer_en, sizeof(buffer_en)) == ESP01_OK)
                {
                    printf("\r\n[NTP] Date/heure: %s\r\n", buffer_fr);
                    printf("[NTP] Date/time: %s\r\n", buffer_en);
                }
            }
            else
            {
                ESP01_LOG_ERROR("NTP", "Erreur lors du parsing de la date");
            }
        }
        else
        {
            ESP01_LOG_WARN("NTP", "Échec de récupération de l'heure NTP");
        }

        // Mise à jour du timestamp de dernière synchro, même en cas d'échec
        g_last_sync_time = current_time;
    }

    return ESP01_OK;
}

/**
 * @brief  Récupère la date/heure NTP depuis le module ESP01 (commande AT).
 * @param  datetime_buf Buffer de sortie.
 * @param  bufsize      Taille du buffer.
 * @retval ESP01_Status_t
 */
ESP01_Status_t esp01_get_ntp_time(char *datetime_buf, size_t bufsize)
{
    VALIDATE_PARAM(datetime_buf && bufsize > 0, ESP01_INVALID_PARAM); // Validation des paramètres

    ESP01_LOG_DEBUG("NTP", "Récupération heure NTP..."); // Log de récupération

    if (esp01_check_buffer_size(ESP01_NTP_DATETIME_BUF_SIZE - 1, bufsize) != ESP01_OK) // Vérification de la taille du buffer
    {
        ESP01_LOG_ERROR("NTP", "Buffer trop petit pour la date NTP"); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_GET_TIME", ESP01_BUFFER_OVERFLOW);    // Retourne l'erreur
    }

    char cmd[] = "AT+CIPSNTPTIME?";          // Commande AT pour obtenir l'heure NTP
    char response[ESP01_MAX_RESP_BUF] = {0}; // Buffer pour la réponse

    ESP01_Status_t st = esp01_send_raw_command_dma(cmd, response, sizeof(response), "OK", ESP01_TIMEOUT_SHORT);
    if (st != ESP01_OK) // Vérification du succès
    {
        ESP01_LOG_ERROR("NTP", "Echec de la commande AT+CIPSNTPTIME? (code=%d)", st); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_GET_TIME", st);                                       // Retourne l'erreur
    }

    ESP01_LOG_DEBUG("NTP", "Réponse brute ESP01 :\n%s", response); // Log de la réponse brute

    st = esp01_parse_string_after(response, "+CIPSNTPTIME:", datetime_buf, bufsize); // Extraction de la date/heure de la réponse
    if (st != ESP01_OK)                                                              // Vérification du parsing
    {
        ESP01_LOG_ERROR("NTP", "Impossible d'extraire la date NTP de la réponse ESP01"); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_GET_TIME", st);                                          // Retourne l'erreur
    }

    // Nettoyer la chaîne en supprimant les espaces et guillemets au début
    char *ptr = datetime_buf;
    while (*ptr == ' ' || *ptr == '\t' || *ptr == '\"')
        ptr++;
    if (ptr != datetime_buf)
        memmove(datetime_buf, ptr, strlen(ptr) + 1);

    if (strlen(datetime_buf) < ESP01_NTP_MIN_DATE_LEN) // Vérification de la longueur minimale
    {
        ESP01_LOG_ERROR("NTP", "Date NTP trop courte ou invalide : %s", datetime_buf); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_GET_TIME", ESP01_FAIL);                                // Retourne l'échec
    }

    ESP01_LOG_DEBUG("NTP", "Heure NTP récupérée : %s", datetime_buf); // Log de succès
    return ESP01_OK;                                                  // Retourne OK
}

/* ==================== FONCTIONS DST (DAYLIGHT SAVING TIME) ==================== */

/**
 * @brief Vérifie si l'heure d'été doit être appliquée selon règles européennes
 * @param dt Structure date/heure
 * @return true si heure d'été active, false sinon
 */
static bool is_dst_active(const ntp_datetime_t *dt)
{
    VALIDATE_PARAM(dt, false);

    ESP01_LOG_DEBUG("NTP", "Vérification du DST pour %02d/%02d/%04d", dt->day, dt->month, dt->year);

