weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_NTP.c
    // Ne pas appliquer le DST si désactivé dans la config
    if (!g_ntp_config.dst_enable)
    {
        ESP01_LOG_DEBUG("NTP", "DST désactivé dans la configuration");
        return false;
    }

    // Règle européenne simplifiée:
    // - Dernier dimanche de mars à 2h -> Dernier dimanche d'octobre à 3h

    if (dt->month < 3 || dt->month > 10)
    {
        // Janvier, février, novembre et décembre: heure d'hiver
        return false;
    }

    if (dt->month > 3 && dt->month < 10)
    {
        // Avril à septembre: heure d'été
        return true;
    }

    // Pour mars: dernier dimanche à 2h -> heure d'été
    if (dt->month == 3)
    {
        // Le dernier dimanche est entre le 25 et le 31
        int last_sunday = 31;
        while (last_sunday >= 25)
        {
            // Calcul simpliste pour exemple
            // Une implémentation complète nécessiterait une formule plus précise
            int wday = (dt->year / 4 + dt->year + 3 + last_sunday) % 7; // Approximation
            if (wday == 0)
                break; // C'est un dimanche
            last_sunday--;
        }

        ESP01_LOG_DEBUG("NTP", "Mars - Dernier dimanche le %d", last_sunday);
        return (dt->day > last_sunday || (dt->day == last_sunday && dt->hour >= 2));
    }

    // Pour octobre: dernier dimanche à 3h -> heure d'hiver
    if (dt->month == 10)
    {
        // Le dernier dimanche est entre le 25 et le 31
        int last_sunday = 31;
        while (last_sunday >= 25)
        {
            // Calcul simpliste pour exemple
            int wday = (dt->year / 4 + dt->year + 0 + last_sunday) % 7; // Approximation
            if (wday == 0)
                break; // C'est un dimanche
            last_sunday--;
        }

        ESP01_LOG_DEBUG("NTP", "Octobre - Dernier dimanche le %d", last_sunday);
        return (dt->day < last_sunday || (dt->day == last_sunday && dt->hour < 3));
    }

    return false;
}

/**
 * @brief Applique le changement d'heure DST si nécessaire
 * @param dt Structure date/heure à modifier
 */
static void apply_dst(ntp_datetime_t *dt)
{
    VALIDATE_PARAM_VOID(dt);

    if (!g_ntp_config.dst_enable)
    {
        dt->dst = false;
        return;
    }

    bool dst_active = is_dst_active(dt);

    if (dst_active)
    {
        // Ajout de la sauvegarde de l'heure actuelle pour le log
        int prev_hour = dt->hour;

        dt->hour += 1;

        // Gestion du passage au jour suivant si nécessaire
        if (dt->hour >= 24)
        {
            dt->hour -= 24;
            dt->day += 1;
            dt->wday = (dt->wday + 1) % 7;

            // Gestion du passage au mois suivant
            static const uint8_t days_in_month[] = {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};
            uint8_t max_days = days_in_month[dt->month];

            // Ajustement pour février en année bissextile
            if (dt->month == 2 && ((dt->year % 4 == 0 && dt->year % 100 != 0) || dt->year % 400 == 0))
            {
                max_days = 29;
            }

            if (dt->day > max_days)
            {
                dt->day = 1;
                dt->month += 1;

                if (dt->month > 12)
                {
                    dt->month = 1;
                    dt->year += 1;
                }
            }
        }

        ESP01_LOG_DEBUG("NTP", "DST appliqué: %02d:xx -> %02d:xx", prev_hour, dt->hour);
        dt->dst = true;
    }
    else
    {
        ESP01_LOG_DEBUG("NTP", "DST non appliqué (heure d'hiver)");
        dt->dst = false;
    }
}

/* ==================== FONCTIONS ONE-SHOT SIMPLES ==================== */

/**
 * @brief Fonction one-shot simple pour obtenir l'heure et l'afficher
 * @param lang Format de l'affichage ('F' pour français, 'E' pour anglais)
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_ntp_get_and_display(char lang)
{
    ESP01_LOG_INFO("NTP", "Récupération et affichage de l'heure NTP (lang=%c)", lang);

    char buffer[ESP01_NTP_DATETIME_BUF_SIZE];
    ntp_datetime_t dt;
    ESP01_Status_t status = esp01_get_ntp_time(buffer, sizeof(buffer));

    if (status != ESP01_OK)
    {
        ESP01_LOG_ERROR("NTP", "Impossible de récupérer l'heure NTP");
        ESP01_RETURN_ERROR("NTP_DISPLAY", status);
    }

    // Vérifier si la date est valide (pas une date proche de 1970)
    if (!esp01_parse_ntp_datetime(buffer, &dt)) // Utiliser la fonction publique, pas la fonction statique
    {
        ESP01_LOG_ERROR("NTP", "Impossible de parser la date NTP");
        ESP01_RETURN_ERROR("NTP_DISPLAY", ESP01_NTP_INVALID_RESPONSE);
    }

    // Vérifier si la date est proche de 1970 (date non synchronisée)
    if (dt.year < 2022)
    {
        ESP01_LOG_WARN("NTP", "Date non synchronisée (%04d/%02d/%02d), serveur NTP probablement inaccessible",
                       dt.year, dt.month, dt.day);
        ESP01_RETURN_ERROR("NTP_DISPLAY", ESP01_NTP_SERVER_NOT_REACHABLE);
    }

    // Affichage selon la langue demandée
    if (lang == 'F' || lang == 'f')
    {
        esp01_print_datetime_fr(&dt);
    }
    else
    {
        char formatted[128];
        esp01_format_datetime_en(&dt, formatted, sizeof(formatted));
        ESP01_LOG_INFO("NTP", "Date/time: %s", formatted);
    }

    // Mettre à jour la variable globale pour stocker la dernière date/heure
    memcpy(&g_last_datetime, &dt, sizeof(ntp_datetime_t));

    return ESP01_OK;
}

/**
 * @brief Formate une date au format français dans un buffer
 * @param dt Structure date/heure
 * @param buffer Buffer de sortie
 * @param size Taille du buffer
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_format_datetime_fr(const ntp_datetime_t *dt, char *buffer, size_t size)
{
    VALIDATE_PARAM(dt && buffer && size >= 40, ESP01_INVALID_PARAM);
    VALIDATE_PARAM(dt->wday <= 6 && dt->month >= 1 && dt->month <= 12, ESP01_INVALID_PARAM);

    static const char *jours_fr[] = {"Dimanche", "Lundi", "Mardi", "Mercredi", "Jeudi", "Vendredi", "Samedi"};
    static const char *mois_fr[] = {"janvier", "février", "mars", "avril", "mai", "juin",
                                    "juillet", "août", "septembre", "octobre", "novembre", "décembre"};

    int written = snprintf(buffer, size, "%s %02d %s %04d à %02dh%02d:%02d%s",
                           jours_fr[dt->wday], dt->day, mois_fr[dt->month - 1], dt->year,
                           dt->hour, dt->min, dt->sec,
                           dt->dst ? " (heure d'été)" : "");

    if (written < 0 || written >= (int)size)
    {
        ESP01_LOG_ERROR("NTP", "Débordement du buffer lors du formatage de date (FR)");
        return ESP01_BUFFER_OVERFLOW;
    }

    return ESP01_OK;
}

/**
 * @brief Formate une date au format anglais dans un buffer
 * @param dt Structure date/heure
 * @param buffer Buffer de sortie
 * @param size Taille du buffer
 * @return ESP01_OK si succès, code d'erreur sinon
 */
ESP01_Status_t esp01_format_datetime_en(const ntp_datetime_t *dt, char *buffer, size_t size)
{
    VALIDATE_PARAM(dt && buffer && size >= 40, ESP01_INVALID_PARAM);
    VALIDATE_PARAM(dt->wday <= 6 && dt->month >= 1 && dt->month <= 12, ESP01_INVALID_PARAM);

    static const char *jours_en[] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
    static const char *mois_en[] = {"January", "February", "March", "April", "May", "June",
                                    "July", "August", "September", "October", "November", "December"};

    // Conversion 24h vers 12h avec AM/PM
    int hour_12 = dt->hour % 12;
    if (hour_12 == 0)
        hour_12 = 12; // 0h -> 12 AM, 12h -> 12 PM

    const char *am_pm = (dt->hour < 12) ? "AM" : "PM";

    int written = snprintf(buffer, size, "%s, %d %s, %04d %d:%02d:%02d %s%s",
                           jours_en[dt->wday],
                           dt->day, mois_en[dt->month - 1], dt->year,
                           dt->hour, dt->min, dt->sec, am_pm,
                           dt->dst ? " (DST)" : "");

    if (written < 0 || written >= (int)size)
    {
        ESP01_LOG_ERROR("NTP", "Débordement du buffer lors du formatage de date (EN)");
        return ESP01_BUFFER_OVERFLOW;
    }

    return ESP01_OK;
}

/* ==================== ACCÈS ET AFFICHAGE ==================== */

/**
 * @brief Affiche la configuration NTP courante (logs).
 */
void esp01_print_ntp_config(void)
{
    ESP01_LOG_INFO("NTP", "Affichage de la configuration NTP");                        // Log d'affichage
    ESP01_LOG_INFO("NTP", "Serveur : %s", g_ntp_config.server);                        // Affichage du serveur
    ESP01_LOG_INFO("NTP", "Fuseau horaire : %d", g_ntp_config.timezone);               // Affichage du fuseau horaire
    ESP01_LOG_INFO("NTP", "Période de synchro (s) : %d", g_ntp_config.period_s);       // Affichage de la période
    ESP01_LOG_INFO("NTP", "DST activé : %s", g_ntp_config.dst_enable ? "OUI" : "NON"); // Affichage de l'état DST
}

/**
 * @brief Affiche la dernière date/heure NTP reçue en français (logs).
 */
void esp01_ntp_print_last_datetime_fr(void)
{
    const char *datetime_ntp = esp01_ntp_get_last_datetime(); // Récupération de la dernière date/heure

    if (!datetime_ntp || strlen(datetime_ntp) == 0) // Vérification de la disponibilité
    {
        ESP01_LOG_WARN("NTP", "Date NTP non disponible"); // Log d'avertissement
        return;                                           // Sortie
    }

    ntp_datetime_t dt;
    if (esp01_parse_ntp_esp01(datetime_ntp, &dt) == ESP01_OK) // Parsing de la date/heure
    {
        // Appliquer DST si activé
        if (g_ntp_config.dst_enable)
        {
            apply_dst(&dt);
        }

        char buffer[100] = {0};
        if (esp01_format_datetime_fr(&dt, buffer, sizeof(buffer)) == ESP01_OK)
        {
            ESP01_LOG_INFO("NTP", "%s", buffer);
        }
    }
    else
    {
        ESP01_LOG_WARN("NTP", "Date NTP invalide"); // Log d'avertissement
    }
}

/**
 * @brief Affiche la dernière date/heure NTP reçue en anglais (logs).
 */
void esp01_ntp_print_last_datetime_en(void)
{
    ESP01_LOG_INFO("NTP", "Affichage de la dernière date/heure NTP (EN)"); // Log d'affichage
    const char *datetime_ntp = esp01_ntp_get_last_datetime();              // Récupération de la dernière date/heure

    if (!datetime_ntp || strlen(datetime_ntp) == 0) // Vérification de la disponibilité
    {
        ESP01_LOG_WARN("NTP", "NTP date not available"); // Log d'avertissement
        return;                                          // Sortie
    }

    ntp_datetime_t dt;
    if (esp01_parse_ntp_esp01(datetime_ntp, &dt) == ESP01_OK) // Parsing de la date/heure
    {
        // Appliquer DST si activé
        if (g_ntp_config.dst_enable)
        {
            apply_dst(&dt);
        }

        char buffer[100] = {0};
        if (esp01_format_datetime_en(&dt, buffer, sizeof(buffer)) == ESP01_OK)
        {
            ESP01_LOG_INFO("NTP", "%s", buffer);
        }
    }
    else
    {
        ESP01_LOG_WARN("NTP", "Invalid NTP date"); // Log d'avertissement
    }
}

/**
 * @brief Retourne la dernière date/heure NTP brute reçue.
 * @return Pointeur sur la chaîne date/heure.
 */
const char *esp01_ntp_get_last_datetime(void)
{
    ESP01_LOG_DEBUG("NTP", "Lecture de la dernière date/heure NTP : %s", g_last_datetime); // Log de lecture
    return g_last_datetime;                                                                // Retourne la dernière date/heure
}

/**
 * @brief Indique si une nouvelle date NTP a été reçue.
 * @return 1 si oui, 0 sinon.
 */
uint8_t esp01_ntp_is_updated(void)
{
    // ESP01_LOG_DEBUG("NTP", "Flag de mise à jour NTP : %d", g_ntp_updated); // Log du flag
    return g_ntp_updated; // Retourne le flag
}

/**
 * @brief Efface le flag "date NTP reçue".
 */
void esp01_ntp_clear_updated_flag(void)
{
    ESP01_LOG_INFO("NTP", "Réinitialisation du flag de mise à jour NTP"); // Log de réinitialisation
    g_ntp_updated = 0;                                                    // Réinitialisation du flag
}

/**
 * @brief Retourne la configuration NTP courante.
 * @return Pointeur sur la structure de config.
 */
const esp01_ntp_config_t *esp01_get_ntp_config(void)
{
    ESP01_LOG_DEBUG("NTP", "Lecture de la configuration NTP"); // Log de lecture
    return &g_ntp_config;                                      // Retourne la configuration
}

/* ==================== PARSING ET UTILITAIRES ==================== */

/**
 * @brief Parse une date brute ESP01 en structure française.
 * @param datetime_ntp Chaîne brute.
 * @param dt Structure de sortie.
 * @return ESP01_OK si succès, ESP01_FAIL sinon.
 */
ESP01_Status_t esp01_parse_ntp_esp01(const char *datetime_ntp, ntp_datetime_t *dt)
{
    ESP01_LOG_DEBUG("NTP", "Parsing de la date NTP : %s", datetime_ntp); // Log du parsing
    VALIDATE_PARAM(datetime_ntp && dt, ESP01_INVALID_PARAM);             // Validation des paramètres

    memset(dt, 0, sizeof(ntp_datetime_t)); // Initialisation propre de la structure

    char mois[8] = {0}, jour[8] = {0}; // Buffers pour le parsing
    // Variables temporaires pour stocker les valeurs entières
    int day, hour, min, sec, year;

    int res = sscanf(datetime_ntp, "%7s %7s %d %d:%d:%d %d",
                     jour, mois, &day, &hour, &min, &sec, &year);

    // Conversion des entiers vers les types appropriés
    if (res == 7)
    {
        dt->day = (uint8_t)day;
        dt->hour = (uint8_t)hour;
        dt->min = (uint8_t)min;
        dt->sec = (uint8_t)sec;
        dt->year = (uint16_t)year;
    }
    else
    {
        ESP01_LOG_ERROR("NTP", "Format de date NTP invalide");
        ESP01_RETURN_ERROR("NTP_PARSE", ESP01_FAIL);
    }

    static const char *mois_en[] = {// Tableau des mois anglais
                                    "Jan", "Feb", "Mar", "Apr", "May", "Jun",
                                    "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};
    dt->month = 0;               // Initialisation du mois
    for (int i = 0; i < 12; ++i) // Recherche du mois
    {
        if (strncmp(mois, mois_en[i], 3) == 0) // Comparaison
        {
            dt->month = i + 1; // Affectation du mois
            break;             // Sortie de boucle
        }
    }
    if (dt->month == 0) // Si mois inconnu
    {
        ESP01_LOG_ERROR("NTP", "Mois NTP inconnu : %s", mois); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_PARSE", ESP01_FAIL);           // Retourne l'échec
    }

