weedmanu/STM32_WIFI-WEB-MQTT-NTP_BY_ESP/STM32_WifiESP_NTP.c
    static const char *jours_en[] = {// Tableau des jours anglais
                                     "Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    dt->wday = 7;               // Valeur par défaut invalide
    for (int i = 0; i < 7; ++i) // Recherche du jour
    {
        if (strncmp(jour, jours_en[i], 3) == 0) // Comparaison
        {
            dt->wday = i; // Affectation du jour
            break;        // Sortie de boucle
        }
    }
    if (dt->wday > 6) // Si jour inconnu (valeur reste à 7)
    {
        ESP01_LOG_ERROR("NTP", "Jour NTP inconnu : %s", jour); // Log d'erreur
        ESP01_RETURN_ERROR("NTP_PARSE", ESP01_FAIL);           // Retourne l'échec
    }

    // Initialiser le flag DST à false (il sera mis à jour plus tard si nécessaire)
    dt->dst = false;

    ESP01_LOG_DEBUG("NTP", "Parsing réussi : %02d/%02d/%04d %02d:%02d:%02d (wday=%d)",
                    dt->day, dt->month, dt->year, dt->hour, dt->min, dt->sec, dt->wday); // Log du parsing réussi
    return ESP01_OK;                                                                     // Retourne OK
}

/**
 * @brief Affiche une structure date/heure en français (logs).
 * @param dt Structure à afficher.
 */
void esp01_print_datetime_fr(const ntp_datetime_t *dt)
{
    VALIDATE_PARAM_VOID(dt);

    if (dt->wday > 6 || dt->month < 1 || dt->month > 12)
    {
        ESP01_LOG_ERROR("NTP", "Structure de date invalide (jour=%d, mois=%d)", dt->wday, dt->month);
        return;
    }

    static const char *jours_fr[] = {"Dimanche", "Lundi", "Mardi", "Mercredi", "Jeudi", "Vendredi", "Samedi"};
    static const char *mois_fr[] = {"janvier", "février", "mars", "avril", "mai", "juin",
                                    "juillet", "août", "septembre", "octobre", "novembre", "décembre"};

    ESP01_LOG_INFO("NTP", "%s %02d %s %04d à %02dh%02d:%02d%s",
                   jours_fr[dt->wday], dt->day, mois_fr[dt->month - 1], dt->year,
                   dt->hour, dt->min, dt->sec,
                   dt->dst ? " (heure d'été)" : "");
}

/**
 * @brief Affiche une structure date/heure en anglais (logs).
 * @param dt Structure à afficher.
 */
void esp01_print_datetime_en(const ntp_datetime_t *dt)
{
    VALIDATE_PARAM_VOID(dt);
    VALIDATE_PARAM_VOID(dt->wday <= 6 && dt->month >= 1 && dt->month <= 12);

    static const char *jours_en[] = {"Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday"};
    static const char *mois_en[] = {"January", "February", "March", "April", "May", "June",
                                    "July", "August", "September", "October", "November", "December"};

    ESP01_LOG_INFO("NTP", "%s, %02d %s %04d %02d:%02d:%02d%s",
                   jours_en[dt->wday], dt->day, mois_en[dt->month - 1], dt->year,
                   dt->hour, dt->min, dt->sec,
                   dt->dst ? " (DST)" : "");
}

/**
 * @brief Parse une chaîne de date/heure au format NTP de l'ESP01
 * @param datetime_str Chaîne de date/heure à parser
 * @param dt Structure de sortie
 * @return true si parsing réussi, false sinon
 */
bool esp01_parse_ntp_datetime(const char *datetime_str, ntp_datetime_t *dt)
{
    ESP01_LOG_DEBUG("NTP", "Parsing de la date NTP : %s", datetime_str);
    VALIDATE_PARAM(datetime_str && dt, false);

    // Format attendu: "Thu Jun 19 11:41:56 2025"
    char day_str[4], month_str[4];
    int day, hour, min, sec, year;

    int matched = sscanf(datetime_str, "%3s %3s %d %d:%d:%d %d",
                         day_str, month_str, &day, &hour, &min, &sec, &year);

    if (matched != 7)
    {
        ESP01_LOG_ERROR("NTP", "Format de date invalide: %s", datetime_str);
        return false;
    }

    // Remplit la structure avec les valeurs extraites
    dt->day = day;
    dt->hour = hour;
    dt->min = min;
    dt->sec = sec;
    dt->year = year;

    // Traduit le mois textuel en numérique
    if (strncmp(month_str, "Jan", 3) == 0)
        dt->month = 1;
    else if (strncmp(month_str, "Feb", 3) == 0)
        dt->month = 2;
    else if (strncmp(month_str, "Mar", 3) == 0)
        dt->month = 3;
    else if (strncmp(month_str, "Apr", 3) == 0)
        dt->month = 4;
    else if (strncmp(month_str, "May", 3) == 0)
        dt->month = 5;
    else if (strncmp(month_str, "Jun", 3) == 0)
        dt->month = 6;
    else if (strncmp(month_str, "Jul", 3) == 0)
        dt->month = 7;
    else if (strncmp(month_str, "Aug", 3) == 0)
        dt->month = 8;
    else if (strncmp(month_str, "Sep", 3) == 0)
        dt->month = 9;
    else if (strncmp(month_str, "Oct", 3) == 0)
        dt->month = 10;
    else if (strncmp(month_str, "Nov", 3) == 0)
        dt->month = 11;
    else if (strncmp(month_str, "Dec", 3) == 0)
        dt->month = 12;
    else
    {
        ESP01_LOG_ERROR("NTP", "Mois invalide: %s", month_str);
        return false;
    }

    // Traduit le jour textuel en numérique (0=dimanche, 1=lundi, ..., 6=samedi)
    if (strncmp(day_str, "Sun", 3) == 0)
        dt->wday = 0;
    else if (strncmp(day_str, "Mon", 3) == 0)
        dt->wday = 1;
    else if (strncmp(day_str, "Tue", 3) == 0)
        dt->wday = 2;
    else if (strncmp(day_str, "Wed", 3) == 0)
        dt->wday = 3;
    else if (strncmp(day_str, "Thu", 3) == 0)
        dt->wday = 4;
    else if (strncmp(day_str, "Fri", 3) == 0)
        dt->wday = 5;
    else if (strncmp(day_str, "Sat", 3) == 0)
        dt->wday = 6;
    else
    {
        ESP01_LOG_ERROR("NTP", "Jour invalide: %s", day_str);
        return false;
    }

    ESP01_LOG_DEBUG("NTP", "Parsing réussi : %02d/%02d/%04d %02d:%02d:%02d (wday=%d)",
                    dt->day, dt->month, dt->year, dt->hour, dt->min, dt->sec, dt->wday);

    // Vérification supplémentaire : si année = 1970, c'est probablement une date non synchronisée
    if (dt->year == 1970)
    {
        ESP01_LOG_WARN("NTP", "Date de l'époque Unix détectée (%04d/%02d/%02d), serveur NTP probablement inaccessible",
                       dt->year, dt->month, dt->day);
    }

    return true;
}
